Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortErr Property
 AdjustEdge is too short - continuable error version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AdjustEdgeTooShortErr { get; }
Visual Basic
Public Shared ReadOnly Property AdjustEdgeTooShortErr As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AdjustEdgeTooShortErr {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace